src/cf/DataProcessors/ЗагрузитьСет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузитьСет</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/SetList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>SetList</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SetName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReleaseDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SetCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузитьСет/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьСписокСетов(Команда)
	
	ПолучитьСписокСетовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокСетовНаСервере()
	
	InformationRegisters.SetList.UpdateData();
	
	ОбновитьСписокВыбораСетов();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьВыбранныйСетНаСервере(ВыбранныйСет, GetExtra)
	
	Set = Справочники.Sets.НайтиПоКоду(ВыбранныйСет, Истина);
	
	If Set.IsEmpty() Then
		Set = Справочники.Sets.СоздатьЭлемент();
		Set.Code = ВыбранныйСет;
		Set.Description = "temp";
		Set.Write();
	Else
		Set = Set.GetObject();
	EndIf;
	
	Set.UpdateData(GetExtra);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранныйСет(Команда)
	ЗагрузитьВыбранныйСетНаСервере(ВыбранныйСет, GetExtra);
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.Cards"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.Sets"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.SetBoosterComposition"));

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокВыбораСетов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораСетов()
	
	ВыбранныйСет = "";
	Элементы.ВыбранныйСет.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SetList.SetCode,
	|	SetList.SetName,
	|	SetList.ReleaseDate КАК ReleaseDate
	|ИЗ
	|	РегистрСведений.SetList КАК SetList
	|
	|УПОРЯДОЧИТЬ ПО
	|	ReleaseDate УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.ВыбранныйСет.СписокВыбора.Добавить(Выборка.SetCode, Выборка.SetCode + " - " + Выборка.SetName + " (" + Формат(Выборка.ReleaseDate, "ДЛФ=D") + ")");	
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокВыбораСетов()
